PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
/*
 * Local prototypes
 */

/* The prototypes of all possible software interrupt service routines. */
#define swInt(idEv)    static void swInt##idEv(void);
swInt(0)
swInt(1)
swInt(2)
swInt(3)
swInt(4)
swInt(5)
swInt(6)
swInt(7)
#undef swInt


/*
 * Data definitions
 */

/** The list of all tasks. */
static rtos_taskDesc_t _taskCfgAry[RTOS_MAX_NO_USER_TASKS] SECTION(.data.OS._taskCfgAry) =
    { [0 ... (RTOS_MAX_NO_USER_TASKS-1)] = { .addrTaskFct = 0
                                             , .PID = 0
                                             , .tiTaskMax = 0
                                           }
    };

/** The list of all process initialization tasks. */
static rtos_taskDesc_t _initTaskCfgAry[1+RTOS_NO_PROCESSES] SECTION(.data.OS._initTaskCfgAry) =
    { [0 ... RTOS_NO_PROCESSES] = { .addrTaskFct = 0
                                    , .PID = 0
                                    , .tiTaskMax = 0
                                  }
    };

/** The number of registered tasks. The range is 0..#RTOS_MAX_NO_USER_TASKS. */
static unsigned int _noTasks SECTION(.sdata.OS._noTasks) = 0;

/** The list of task activating events. */
static eventDesc_t SECTION(.data.OS._eventAry) _eventAry[RTOS_MAX_NO_EVENTS] =
    { DEFAULT_EVENT(0), DEFAULT_EVENT(1), DEFAULT_EVENT(2), DEFAULT_EVENT(3)
      , DEFAULT_EVENT(4), DEFAULT_EVENT(5), DEFAULT_EVENT(6), DEFAULT_EVENT(7)
    };

/** The number of created events. The range is 0..8. The events are implemented by
    software interrupts and these are limited by hardware to a number of eight. */
static unsigned int _noEvents SECTION(.sdata.OS._noEvents) = 0;

/** Time increment of one tick of the RTOS system clock. It is set at kernel initialization
    time to the configured period time of the system clock in Milliseconds
    (#RTOS_CLOCK_TICK_IN_MS). This way the unit of all time designations in the RTOS API
    always stays Milliseconds despite of the actually chosen clock rate. (An application of
    the RTOS can reduce the clock rate to the lowest possible value in order to save
    overhead.) The normal settings are a clock rate of 1 kHz and
    #RTOS_CLOCK_TICK_IN_MS=1.\n
      The variable is initially set to zero to hold the scheduler during RTOS
    initialization. */
static unsigned long _tiOsStep SECTION(.sdata.OS._tiStepOs) = 0;

/** RTOS sytem time in Milliseconds since start of kernel. */
static unsigned long _tiOs SECTION(.sdata.OS._tiOs) = (unsigned long)-1;

/** The option for inter-process communication to let a task of process A run a task in
    process B (system call rtos_runTask()) is potentially harmful, as the started task can
    destroy on behalf of process A all data structures of the other process B. It's of
    course not generally permittable. An all-embracing privilege rule cannot be defined
    because of the different use cases of the mechanism. Therefore, we have an explicit
    table of granted permissions, which can be configured at startup time as an element of
    the operating system initialization code.\n
      The bits of the word correspond to the 16 possible combinations of four possible
    caller processes in four possible target processes.
      By default, no permission is granted. */
#if RTOS_NO_PROCESSES == 4
static uint16_t SDATA_OS(_runTask_permissions) = 0;
#else
# error Implementation depends on four being the number of processes
#endif


/*
 * Function implementation
 */

/**
 * Registration of a task. Normal, event activated tasks and process initialization tasks
 * can be registered for later execution. This can be both, user mode tasks and operating
 * system tasks. This function is repeatedly called by the application code as often as
 * tasks are required.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the task could be registered. The maximum number of normal
 * tasks is limited to #RTOS_MAX_NO_USER_TASKS (regardless, how they are distributed among
 * processes). The maximum number of initialization tasks is one per process or for the OS.
 * If the limit is exceeded or if the task specification is invalid then the function
 * returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param idEvent
 * Any (normal) task is activated by an event and a task without related event is useless.
 * This call associates the registered task with an already created event. See
 * rtos_osCreateEvent().\n
 *   If a process or OS initialization task is registered, then \a idEvent is set to
 * #EVENT_ID_INIT_TASK. It is allowed not to register an init task for a process or
 * for the OS but it is not possible to register more than one (or to re-register an) init
 * task for a given process or the OS.\n
 *   The order of registration of several tasks with one and the same event matters. The
 * tasks will be acivated in order of registration whenever the event becomes due or is
 * triggered by software.\n
 *   The order of registration doesn't matter for initialization tasks! The OS
 * initialization task is served first. Processes are always initialized in order of rising
 * process ID. The most privileged process is served last and can thus override descisions
 * of its less privileged predecessors.
 *   @param addrTaskFct
 * The task function, which is run in process \a PID every time, the event \a idEvent
 * triggers.
 *   @param PID
 *   The process the task belongs to by identifier. We have a fixed, limited number of four
 * processes (#RTOS_NO_PROCESSES) plus the kernel process, which has ID 0. The range of
 * process IDs to be used here is 0 .. #RTOS_NO_PROCESSES.\n
 *   @param tiTaskMaxInUs
 * Time budget for the user task in Microseconds. This budget is granted for each
 * activation of the task, i.e. each run of \a addrTaskFct(). The budget relates to
 * deadline monitoring, i.e. it is a world time budget, not an execution time budget.\n
 *   Deadline monitoring is supported up to a maximum execution time of
 * #RTOS_TI_DEADLINE_MAX_IN_US Microseconds.\n
 *   A value of zero means that deadline monitoring is disabled for the task.\n
 *   There's no deadline monitoring for OS tasks. If \a PID is zero then \a
 * tiTaskMaxInUS meeds to be zero, too.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
static rtos_errorCode_t registerTask( unsigned int idEvent
                                    , uintptr_t addrTaskFct
                                    , unsigned int PID
                                    , unsigned int tiTaskMaxInUs
                                    )
{
    /* The scheduler should be in halted state. */
    if(_tiOsStep != 0)
        return rtos_err_configurationOfRunningKernel;

    /* The event need to be created before the task can be registered. */
    if(idEvent >= _noEvents  &&  idEvent != EVENT_ID_INIT_TASK)
        return rtos_err_badEventId;

    /* The process ID needs to be in the fixed and limited range. */
    if(PID > RTOS_NO_PROCESSES)
        return rtos_err_badProcessId;

