PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
        } /* End if(Timer or application software activated task?) */
    } /* End for(All configured events) */

} /* End of checkEventDue */



/**
 * The OS default timer handler. In function rtos_osInitKernel(), it is associated with the
 * PIT0 interrupt. You must not call this function yourself. The routine is invoked once
 * every #RTOS_CLOCK_TICK_IN_MS Milliseconds and triggers most of the scheduler decisions.
 * The application code is expected to run mainly in regular tasks and these are activated
 * by this routine when they become due. All the rest is done by the interrupt controller
 * INTC.
 *   @remark
 * The INTC priority at which this function is executed is configured as
 * #RTOS_KERNEL_PRIORITY. One can set it to the highest available interrupt priority, but
 * this is not a must. Chosing the highest possible priority would be driven by the concept
 * that the scheduler can force the execution of an application task in disfavor of any
 * other context. No difference is then made between interrupt service routines and regular
 * application tasks.\n
 *   However, most RTOSs distiguish between pure interrupt service routines and application
 * tasks and let the latter generally have a priority lower than all of the former. And
 * they would never preempt an interrupt in favor of an application task. If this behavior
 * is modelled then the priority demand would change to "the highest application task
 * priority plus one".\n
 *   An important aspect in this discussion is the availablity of the priority ceiling
 * protocol (PCP) for mutual exclusion of contexts. It is available only up to and
 * including priority level #RTOS_MAX_LOCKABLE_PRIORITY (The range till
 * #RTOS_KERNEL_PRIORITY-1 is reserved for non-suppressible safety tasks). An ISR running
 * above this level cannot have a critical section with user code and data exchange needs
 * to apply more complicated techniques, e.g. double-buffering.
 */
static void onOsTimerTick(void)
{
    /* Note, the scheduler function needs to run at highest priority, which means that no
       task or ISR can preempt this code. No mutual exclusion code is required. */

    /* Update the system time. */
    _tiOs += _tiOsStep;

    /* The scheduler is most simple; the only condition to make a task ready is the next
       periodic due time. The task activation is fully left to the hardware of the INTC and
       we don't have to bother with priority handling or task/context switching. */
    checkEventDue();

        /* Acknowledge the timer interrupt in the causing HW device. */
    PIT.TFLG0.B.TIF = 0x1;

} /* End of onOsTimerTick */



/**
 * Creation of an event. The event can be cyclically triggering or software triggered.
 * An event is needed to activate a user task. Therefore, any reasonable application will
 * create at least one event.\n
 *   This function is repeatedly called by the application code for each required event.
 * All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().\n
 *   @return
 * \a rtos_err_noError (zero) if the event could be created. The maximum number of events
 * is limited to #RTOS_MAX_NO_EVENTS by hardware constraints. If the event cannot be
 * created due to this constraint or if the event descriptor contains invalid data then
 * then the function returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param pEventId
 * All events are identified by a positive integer. Normally this ID is returned by
 * reference in * \a pEventId. If the event cannot be created then #RTOS_INVALID_EVENT_ID
 * is returned in * \a pEventId.\n
 *   Note, it is guaranteed to the caller that the returned ID is not an arbitrary,
 * meaningless number. Instead, the ID is counted from zero in order of creating events.
 * The first call of this function will return 0, the second 1, and so on. This simplifies
 * ID handling in the application code, constants can mostly be applied as the IDs are
 * effectively known at compile time.
 *   @param tiCycleInMs
 * The period time for regularly triggering events in ms.\n
 *   The permitted range is 0..2^30-1. 0 means no regular, timer controlled trigger and the
 * event is only enabled for software trigger using rtos_triggerEvent() (permitted for
 * interrupts or other tasks).
 *   @param tiFirstActivationInMs
 * The first trigger of the event in ms after start of kernel. The permitted range is
 * 0..2^30-1.\n
 *   Note, this setting is useless if a cycle time zero in \a tiCycleInMs specifies a non
 * regular event. \a tiFirstActivationInMs needs to be zero in this case, too.
 *   @param priority
 * The priority of the event in the range 1..(#RTOS_KERNEL_PRIORITY-1). Different events
 * can share the same priority or have different priorities. The priotrity of an event is
 * the priority of all associated tasks at the same time. The execution of tasks, which
 * share the priority will be serialized when they are activated at same time or with
 * overlap.\n
 *   Note the safety constraint that the highest permitted priorities,
 * #RTOS_MAX_LOCKABLE_PRIORITY+1 till #RTOS_KERNEL_PRIORITY-1, are available only to
 * events, which solely have tasks associated that belong to the process with highest
 * process ID in use.\n
 *   Note, the order in which events are created can affect the priority in a certain
 * sense. If two events are created with same priority and when they at runtime become due
 * at the same OS time tick then the earlier created event will trigger its associated user
 * tasks before the later ceated event.
 *   @param minPIDToTriggerThisEvent
 * An event can be triggered by user code, using rtos_triggerEvent(). However, tasks
 * belonging to less privileged processes must not generally have permission to trigger
 * events that may activate tasks of higher privileged processes. Since an event is not
 * process related, we make the minimum process ID, which is required to trigger this
 * event, an explicitly configured property of the event.\n
 *   Only tasks belonging to a process with PID >= \a minPIDToTriggerThisEvent are
 * permitted to trigger this event.\n
 *   The range of \a minPIDToTriggerThisEvent is 0 ... (#RTOS_NO_PROCESSES+1). 0 and 1 both
 * mean, all processes may trigger the event, (#RTOS_NO_PROCESSES+1) means only OS code can
 * trigger the event. (#RTOS_NO_PROCESSES+1) is available as
 * #RTOS_EVENT_NOT_USER_TRIGGERABLE, too.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
rtos_errorCode_t rtos_osCreateEvent( unsigned int *pEventId
                                   , unsigned int tiCycleInMs
                                   , unsigned int tiFirstActivationInMs
                                   , unsigned int priority
                                   , unsigned int minPIDToTriggerThisEvent
                                   )
{
    *pEventId = RTOS_INVALID_EVENT_ID;

