PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
    /* Fill all process stacks with the empty-pattern, which is applied for computing the
       stack usage. */
    bool isProcessConfiguredAry[1+RTOS_NO_PROCESSES] = {[0 ... RTOS_NO_PROCESSES] = false};
    if(errCode == rtos_err_noError)
        errCode = rtos_initProcesses(isProcessConfiguredAry);

    unsigned int idxTask
               , maxPIDInUse = 0;
    /* Find the highest PID in use. */
    for(idxTask=0; idxTask<_noTasks; ++idxTask)
        if(_taskCfgAry[idxTask].PID > maxPIDInUse)
            maxPIDInUse = _taskCfgAry[idxTask].PID;

    /* A task must not belong to an invalid configured process. This holds for init and for
       run time tasks. */
    unsigned int idxP;
    if(errCode == rtos_err_noError)
    {
        for(idxTask=0; idxTask<_noTasks; ++idxTask)
        {
            assert(_taskCfgAry[idxTask].PID < sizeOfAry(isProcessConfiguredAry));
            if(!isProcessConfiguredAry[_taskCfgAry[idxTask].PID])
                errCode = rtos_err_taskBelongsToInvalidPrc;

        } /* For(All registered runtime tasks) */

        for(idxP=0; idxP<1+RTOS_NO_PROCESSES; ++idxP)
        {
            /* Note, the init task array is - different to the runtime task array
               _taskCfgAry - ordered by PID. The field PID in the array entries are
               redundant. A runtime check is not appropriate as this had happened at
               registration time. We can place a simple assertion here. */
            if(_initTaskCfgAry[idxP].addrTaskFct != 0)
            {
                assert(_initTaskCfgAry[idxP].PID == idxP);
                if(!isProcessConfiguredAry[idxP])
                    errCode = rtos_err_taskBelongsToInvalidPrc;
            }
        } /* for(All possibly used processes) */
    }

    /* Now knowing, which is the process with highest privileges we can double-check the
       permissions granted for using the service rtos_runTask(). It must not be possible to
       run a task in the process with highest privileges. */
    if(errCode == rtos_err_noError)
    {
        /* Caution: Maintenance of this code is required consistently with
           rtos_osGrantPermissionRunTask() and rtos_scFlHdlr_runTask(). */
        assert(maxPIDInUse <= 4);
        const uint16_t mask = maxPIDInUse >= 1
                              ? 0x1111 << (maxPIDInUse-1)   /* Normal situation */
                              : 0xffff;                     /* No process in use */
        if((_runTask_permissions & mask) != 0)
            errCode = rtos_err_runTaskBadPermission;
    }

    /* We could check if a process, an init task is registered for, has a least one runtime
       task. However, it is not harmful if not and there might be pathologic applications,
       which solely consist of I/O driver callbacks. */

    if(errCode == rtos_err_noError)
    {
        unsigned int idxEv;
        for(idxEv=0; idxEv<_noEvents; ++idxEv)
        {
            /* Check task configuration: Events without an associated task are useless and
               point to a configuration error. */
            if(_eventAry[idxEv].noTasks == 0)
                errCode = rtos_err_eventWithoutTask;

            /* If an event has a priority above #RTOS_MAX_LOCKABLE_PRIORITY then only those
               tasks can be associated, which belong to the process with highest PID in use
               or OS tasks. This is a safety constraint. */
            if(_eventAry[idxEv].priority > RTOS_MAX_LOCKABLE_PRIORITY)
            {
                for(idxTask=0; idxTask<_eventAry[idxEv].noTasks; ++idxTask)
                {
                    const unsigned int PID = _eventAry[idxEv].taskAry[idxTask].PID;
                    if(PID > 0  &&  PID != maxPIDInUse)
                        errCode = rtos_err_highPrioTaskInLowPrivPrc;
                }
            } /* End if(Unblockable priority is in use by event) */
        } /* for(All registered events) */
    }

    /* After checking the static configuration, we can enable the dynamic processes.
       Outline:
       - Disable all processes (which is their initial state). Once we enable the
         interrupts, the I/O drivers start working and they may invoke callbacks into the
         processes. The execution of these callbacks will be inhibited
       - Initialize the memory protection. This needs to be done before the very first user
         mode task function has the chance to become started. (The very first user mode task
         functions need to be the process initialization tasks.)
       - Disable the scheduler to trigger any events (which is its initial state).
         Triggering events would not cause any user tasks to execute (processes still
         disabled) but their due counters would already run and the configured startup
         conditions would not be met later when enabling the processes
       - Globally enable interrupt processing. I/O drivers and OS clock tick are running.
         This is a prerequisite for the deadline monitoring, which we want to have in place
         already for the init tasks
       - Sequentially execute all configured process initialization tasks. There are no
         crosswise race condition and nor with user tasks or I/O driver callbacks. Note,
         interrupts are already running and cause race conditions. Moreover, they could
         make use of rtos_osTriggerEvent() and if an OS task is associated with the
         triggered event then there would be race conditions with this OS task, too
       - Enable the processes and release the scheduler; scheduler, user tasks and I/O
         driver's callbacks start running */

    /* Arm the memory protection unit. */
    if(errCode == rtos_err_noError)
        rtos_initMPU();

    /* Stop the scheduler. It won't run although the RTOS clock starts spinning. We don't
       want to see a running user task during execution of the init tasks. */
    _tiOs = (unsigned long)-1;
    _tiOsStep = 0;

    /* We can register all SW interrupt service routines. */
    if(errCode == rtos_err_noError)
    {
        /* Install all software interrupts, which implement the events. */
        #define INSTALL_SW_IRQ(idEv)                                                \
            if(idEv < _noEvents)                                                    \
            {                                                                       \
                /* Reset a possibly pending interrupt bit of the SW interrupt. */   \
                *((vuint8_t*)&INTC.SSCIR0_3.R + (idEv)) = 0x01;                     \
                rtos_osRegisterInterruptHandler( &swInt##idEv                       \
                                               , /* vectorNum */ idEv               \
                                               , _eventAry[idEv].priority           \
                                               , /* isPreemptable */ true           \
                                               );                                   \
            }
        INSTALL_SW_IRQ(0)
        INSTALL_SW_IRQ(1)
        INSTALL_SW_IRQ(2)
        INSTALL_SW_IRQ(3)
        INSTALL_SW_IRQ(4)
        INSTALL_SW_IRQ(5)
        INSTALL_SW_IRQ(6)
        INSTALL_SW_IRQ(7)
        #undef INSTALL_SW_IRQ

        /* Disable all PIT timers during configuration. */
        PIT.PITMCR.R = 0x2;

