PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
        /* Install the interrupt service routine for cyclic timer PIT 0. It drives the OS
           scheduler for cyclic task activation. */
        rtos_osRegisterInterruptHandler( &onOsTimerTick
                                       , /* vectorNum */ 59
                                       , RTOS_KERNEL_PRIORITY
                                       , /* isPremptable */ true
                                       );

        /* Peripheral clock has been initialized to 120 MHz. To get a 1ms interrupt tick we
           need to count till 120000. We configure an interrupt rate of RTOS_CLOCK_TICK_IN_MS
           Milliseconds.
             -1: See MCU reference manual, 36.5.1, p. 1157. */
        PIT.LDVAL0.R = 120000u*RTOS_CLOCK_TICK_IN_MS -1;

        /* Enable interrupts by this timer and start it. */
        PIT.TCTRL0.R = 0x3;

        /* Enable timer operation and let them be stopped on debugger entry. Note, this is a
           global setting for all four timers, even if we use and reserve only one for the
           RTOS.
             Note, that this doesn't release the scheduler yet; the step size is still zero
           and the system time doesn't advance despite of the starting timer interrupt. */
        PIT.PITMCR.R = 0x1;
    }

    /* All processes are initialized by rtos_initProcesses() in stopped state: We don't want
       to see a callback from an I/O driver after resuming interrupt processing and while
       an init task is executed. Note, it doesn't really matter if interrupt processing was
       resumed already before. */
    if(errCode == rtos_err_noError)
        rtos_osResumeAllInterrupts();

    /* When we get here (and if we didn't see a configuration error) then all kernel
       interrupts are configured, interrupts occur and are processed, but no user tasks are
       activated nor will an I/O driver run a callback. We can safely start our process
       initialization tasks. */

    /* Run all process initialization in order of increasing PID. A process with higher
       privileges is initialized after another with less privileges. The higher privileged
       could override settings made by its predecessor.
         In this consideration and despite of its PID zero, the operating system process
       has the highest privileges. This requires a loop counter like 1, 2, ..., N, 0. */
    idxP = 0;
    do
    {
#if RTOS_NO_PROCESSES > 0
        if(idxP < RTOS_NO_PROCESSES)
            ++ idxP;
        else
            idxP = 0;
#else
        /* No processes, just initialize the OS. idxP=0 is only loop cycle. */
#endif

        /* The specification of an initialization task is an option only. Check for NULL
           pointer. */
        if(_initTaskCfgAry[idxP].addrTaskFct != 0)
        {
            if(isProcessConfiguredAry[idxP])
            {
                /* Everything is alright. Run the initialization task. A negative return
                   value is defined to be an error. (This needs to be considered by the
                   implementation of the task.) */
                int32_t resultInit;
                if(_initTaskCfgAry[idxP].PID == 0)
                {
                    /* OS initialization function: It is a normal sub-function call; we are
                       here in the OS context. */
                    resultInit = ((int32_t (*)(void))_initTaskCfgAry[idxP].addrTaskFct)();
                }
                else
                {
                    /* The initialization function of a process is run as a task in that
                       process, which involves full exception handling and possible abort
                       causes. */
                    resultInit = rtos_osRunInitTask(&_initTaskCfgAry[idxP]);
                }
                if(resultInit < 0)
                    errCode = rtos_err_initTaskFailed;
            }
            else
            {
                /* An initialization task must not be registered for a process, which is not
                   configured. This had been checked above and we can never get here. */
                assert(false);
            }
        } /* End if(Init task configured for process?) */
    }
    while(idxP != 0);  /* End for(All possible processes, OS as last one) */

    /* After successfully completing all the initialization tasks, we can release the
       scheduler and the processes. We do this in a critical section in order to not
       endanger the specified relationship of initial task activations (specified in terms
       of task priority, period time and initial due time). */
    if(errCode == rtos_err_noError)
    {
        rtos_osSuspendAllInterrupts();

        /* Process state: Set to running (not zero) only if configuration generally okay. */
        unsigned int idxP;
        for(idxP=1; idxP<1+RTOS_NO_PROCESSES; ++idxP)
            if(isProcessConfiguredAry[idxP])
                rtos_osReleaseProcess(/* PID */ idxP);

        /* Release scheduler. */
        _tiOsStep = RTOS_CLOCK_TICK_IN_MS;

        rtos_osResumeAllInterrupts();
    }

    /* @todo Shall we offer idle tasks per process? If so, we cannot leave the routine but
       would need to enter an infinite loop - and had to offer such a function for OS, too.
       For consistency reasons this would require an init function for OS, too. */

    return errCode;

} /* End of rtos_osInitKernel */




/**
 * Trigger an event to activate all associated tasks. A event, which had been registered
 * with cycle time zero is normally not executed. It needs to be triggered with this
 * function in order to make its associated tasks run once, i.e. to make its task functions
 * executed once as result of this call.\n
 *   This function can be called from any task or ISR. However, if the calling task belongs
 * to the set of tasks associated with \a idEvent, then it'll have no effect but an
 * accounted activation loss; an event can be re-triggered only after all associated
 * activations have been completed. There is no activation queueing. The function returns \a
 * false in this case.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the triggered event then the activating
 * task is immediately preempted to the advantage of the activated task. Otherwise the
 * activated task is chained and executed after the activating task.
 *   @return
 * There is no activation queuing. Consequently, triggering the event can fail if at least
 * one of the associated tasks has not yet completed after the previous trigger of the
 * event. The function returns \a false and the activation loss counter of the event is
 * incremented. (See rtos_getNoActivationLoss().) In this situation, the new trigger is
 * entirely lost, i.e. none of the associated tasks will be activated by the new trigger.
 *   @param idEvent
 * The ID of the event to activate as it had been got by the creation call for that event.
 * (See rtos_osCreateEvent().)
 *   @remark
 * The function is indented to start a non cyclic task by application software trigger but
 * can be applied to cyclic tasks, too. In which case the task function of the cyclic task
 * would be invoked once additionally. Note, that an event activation loss is not unlikely in
 * this case; the cyclic task may currently be busy.
 *   @remark
 * It is not forbidden but useless to let a task activate itself by triggering the event it
 * is associated with. This will have no effect besides incrementing the activation loss
 * counter for that event.
 *   @remark
 * This function must be called from the OS context only. It may be called from an ISR to
 * implement delegation to a user task.
 */
bool rtos_osTriggerEvent(unsigned int idEvent)
{
    /* The events are related to the eight available software interrupts. Each SWIRQ is
       controlled by two bits in one out of two status registers of the INTC (RM, 28, p.
       911ff). Access to INTC_SSCIR is described at 28.4.2 and 28.4.7. */
    bool intFlagNotYetSet = true;
    vuint8_t * const pINTC_SSCIR = (vuint8_t*)&INTC.SSCIR0_3.R + idEvent;

    /* To make this function reentrant with respect to one and the same target SW IRQ, we
       need to encapsulate the flag-test-and-set operation in a critical section.
         As a side effect, we can use the same critical section for race condition free
       increment of the error counter in case. */
    const uint32_t msr = rtos_osEnterCriticalSection();
    {
        /* Read software interrupt bit of the task. If it is still set then we have an
           overrun of the associated tasks. Otherwise we activate the tasks by requesting
           the related software interrupt. */
        if(*pINTC_SSCIR == 0)
        {
            /* Put task into ready state (and leave the activation to the INTC). It
               is important to avoid a read-modify-write operation, don't simply
               set a single bit, the other three interrupts in the same register
               could be harmed.
                 The time gap between register read and write shapes a race condition with
               the scheduler for cyclic events and generally with other tasks using this
               function. An activation loss may be not recognized. */
            *pINTC_SSCIR = 0x3;

            /* Operation successful. */
        }
        else
        {
            /* CLRi is still set, interrupt has not completed yet, task has not terminated
               yet. We neither set nor clear the interrupt bit. */
            const unsigned int noActivationLoss = _eventAry[idEvent].noActivationLoss + 1;
            if(noActivationLoss > 0)
                _eventAry[idEvent].noActivationLoss = noActivationLoss;

            /* Activation failed. */
            intFlagNotYetSet = false;
        }
    }
    rtos_osLeaveCriticalSection(msr);

