PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
    return intFlagNotYetSet;

} /* End of rtos_osTriggerEvent */



/**
 * System call handler implementation to trigger an event (and to activate the associated
 * tasks). Find all details in rtos_osTriggerEvent().
 *   @return
 * \a true if activation was possible, \a false otherwise.
 *   @param pidOfCallingTask
 * Process ID of calling user task. The operation is permitted only for tasks belonging to
 * those processes, which
 * have an ID that is greater of equal to the minimum specified for the event in question.
 * Otherwise an exception is raised, which aborts the calling task.
 *   @param idEvent
 * The ID of the event to trigger. This is the ID got from rtos_osCreateEvent().
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
uint32_t rtos_scFlHdlr_triggerEvent(unsigned int pidOfCallingTask, unsigned int idEvent)
{
    /// @todo Do we really need a full handler here? Using the simple, non-preemptable
    // handler would delay the preemption by an activated task of higher priority until we
    // have entirely returned from the system call but we would burden the kernel stack
    // less. Which counts more?
    if(idEvent < _noEvents  &&  pidOfCallingTask >= _eventAry[idEvent].minPIDForTrigger)
        return (uint32_t)rtos_osTriggerEvent(idEvent);
    else
    {
        /* The user specified task ID is not in range. This is a severe user code error,
           which is handled with an exception, task abort and counted error.
             Note, this function does not return. */
        rtos_osSystemCallBadArgument();
    }
} /* End of rtos_scFlHdlr_triggerEvent */



/**
 * System call handler implementation to create and run a task in another process. Find
 * more details in rtos_osRunTask().\n
 *   Start a user task. A user task is a C function, which is executed in user mode and in
 * a given process context. The call is synchronous; the calling user context is
 * immediately preempted and superseded by the started task. The calling user context is
 * resumed when the task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling user task. It can be preempted
 * only by contexts of higher priority.\n
 *   The function requires sufficient privileges. By default the use of this function is
 * forbidden. The operating system startup code can however use
 * rtos_osGrantPermissionRunTask() to enable particular pairs of calling and target
 * process for this service. The task can generally not be started in the OS context.\n
 *   The function cannot be used recursively. The created task cannot in turn make use of
 * rtos_runTask().
 *   @return
 * The executed task function can return a value, which is propagated to the calling user
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_runTask() returns #RTOS_ERR_PRC_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pidOfCallingTask
 * The ID of the process the task belongs to, which invoked the system call.
 *   @param pUserTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param taskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
uint32_t rtos_scFlHdlr_runTask( unsigned int pidOfCallingTask
                              , const rtos_taskDesc_t *pUserTaskConfig
                              , uintptr_t taskParam
                              )
{
    if(!rtos_checkUserCodeReadPtr(pUserTaskConfig, sizeof(rtos_taskDesc_t)))
    {
        /* User code passed in an invalid pointer. We must not even touch the contents.
             Note, the next function won't return. */
        rtos_osSystemCallBadArgument();
    }

    /* This code depends on specific number of processes, we need a check. The
       implementation requires consistent maintenance with other function
       rtos_osGrantPermissionRunTask() */
#if RTOS_NO_PROCESSES != 4
# error Implementation requires the number of processes to be four
#endif

    /* Now we can check the index of the target process. */
    const unsigned int idxCalledPrc = pUserTaskConfig->PID - 1u;
    if(idxCalledPrc > 3)
        rtos_osSystemCallBadArgument();

    const uint16_t mask = 0x1 << (4u*(pidOfCallingTask-1u) + idxCalledPrc);
    if((_runTask_permissions & mask) != 0)
    {
        /* We forbid recursive use of this system call not because it would be technically
           not possible but to avoid an overflow of the supervisor stack. Each creation of
           a user task puts a stack frame on the SV stack. We cannnot detect a recursion
           but we can hinder the SV stack overflow by making the current context's priority
           a gate for further use of this function: The next invokation needs to appear at
           higher level. This will limit the number of stack frames similar as this is
           generally the case for interrupts.
             Note, a user task can circumvent the no-recursion rule by abusing the priority
           ceiling protocol to increment the level by one in each recursion. This is
           technically alright and doesn't impose a risk. The number of available PCP
           levels is strictly limited and so is then the number of possible recursions. The
           SV stack is protected. */
        static uint32_t SDATA_OS(minPriorityLevel_) = 0;

        uint32_t currentLevel = INTC.CPR_PRC0.R
               , minPriorityLevelOnEntry;

