PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos_scheduler.c
        rtos_osSuspendAllInterrupts();
        const bool isEnabled = currentLevel >= minPriorityLevel_;
        if(isEnabled)
        {
            minPriorityLevelOnEntry = minPriorityLevel_;
            minPriorityLevel_ = currentLevel+1;
        }
        rtos_osResumeAllInterrupts();

        if(isEnabled)
        {
            /* All preconditions fulfilled, lock is set, run the task. */
            const int32_t taskResult = rtos_osRunUserTask(pUserTaskConfig, taskParam);

            /* Restore the pre-requisite for future use of this system call. */
            rtos_osSuspendAllInterrupts();

            /* The warning "'minPriorityLevelOnEntry' may be used uninitialized" is locally
               switched off. Justification: Variable is only used if(isEnabled) and then it
               is initialized, too. */
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmaybe-uninitialized"
            minPriorityLevel_ = minPriorityLevelOnEntry;
#pragma GCC diagnostic pop

            rtos_osResumeAllInterrupts();

            return (uint32_t)taskResult;
        }
        else
        {
            /* Bad use of function, penalty is task abortion.
                 Note, this function does not return. */
            rtos_osSystemCallBadArgument();
        }
    }
    else
    {
        /* The user doesn't have the privileges to run the aimed task. This is a severe
           user code error, which is handled with an exception, task abort and counted
           error.
             Note, this function does not return. */
        rtos_osSystemCallBadArgument();
    }
} /* End of rtos_scFlHdlr_runTask */




/**
 * An event, which becomes due may not be able to activate all its associated tasks because
 * they didn't terminate yet after their previous activation. It doesn't matter if this
 * happens because a cyclic task becomes due or because an event task has been triggered by
 * software (using rtos_triggerEvent()). The scheduler counts the failing activations on a
 * per event base. The current value can be queried with this function.
 *   @return
 * Get the current number of triggers of the given event, which have failed since start of
 * the RTOS scheduler. The counter is saturated and will not wrap around.\n
 *   The returned count can be understood as number of task overrun events for all
 * associated tasks.
 *   @param idEvent
 * Each event has its own counter. The value is returned for the given event. The range is 0
 * .. number of registered events minus one (double-checked by assertion).
 *   @remark
 * This function can be called from both, the OS context and a user task.
 */
unsigned int rtos_getNoActivationLoss(unsigned int idEvent)
{
    if(idEvent < _noEvents)
        return _eventAry[idEvent].noActivationLoss;
    else
    {
        assert(false);
        return UINT_MAX;
    }
} /* End of rtos_getNoActivationLoss */